cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'sbt'
brew 'jq'
brew 'postgresql'
brew 'mysql'
brew 'coreutils'
brew 'nginx'
brew 'redis'
brew 'git'
brew 'ispell'
brew 'fish'
brew 'node'
brew 'ruby'
brew 'yarn'
brew 'selecta'
brew 'shellcheck'
brew 'cloc'
brew 'fswatch'
brew 'mas'

cask 'emacs'
cask 'sequel-pro'
cask 'iterm2'
cask '1password'
cask 'atom'
cask 'google-chrome'
cask 'slack'
cask 'transmission'
cask 'spotify'
cask 'appzapper'
cask 'flux'
cask 'skype'
cask 'logitech-options'
cask 'cocoarestclient'
cask 'postman'
cask 'taskpaper'
cask 'docker'

mas 'Tweetbot', id: 557168941
mas 'iMovie', id: 408981434
mas 'Keynote', id: 409183694
mas 'GarageBand', id: 682658836
mas 'Pages', id: 409201541
mas 'Numbers', id: 409203825

# Used at Famly.
brew 'homebrew/php/composer'
brew 'php70'
brew 'php70-mcrypt'
brew 'php70-redis'
brew 'php70-xdebug'
brew 'ios-deploy'
cask 'phpstorm'
